app/controllers/ideas_controller.rb

SELECT "ideas".* FROM "ideas"
---
  def index
    @ideas = Idea.all

SELECT "comments".* FROM "comments" WHERE "comments"."idea_id" = ?  [["idea_id", 2]]
---
  def show
    @comments = @idea.comments.all

INSERT INTO "ideas" ("name", "description", "picture", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "tinh"], ["description", "qwert"], ["picture", "dxftuskpsznefloj115o.jpg"], ["created_at", "2017-09-17 04:42:47.687077"], ["updated_at", "2017-09-17 04:42:47.687077"], ["user_id", 2]]
---
  def create
    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save

UPDATE "ideas" SET "picture" = ?, "user_id" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["picture", "tnw2996pjjvnamk3qpht.gif"], ["user_id", 3], ["updated_at", "2017-09-17 06:11:28.408611"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @idea.update(idea_params)

DELETE FROM "ideas" WHERE "ideas"."id" = ?  [["id", 1]]
---
  def destroy
    @idea.destroy

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_idea
      @idea = Idea.find(params[:id])